# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "nicoverbruggen/homebrew-cask"

# Binaries
brew "bash" # Latest Bash version
brew "coreutils" # Those that come with macOSre outdated
brew "grep"
#brew "ffmpeg"
brew "gh"
brew "git"
brew  "mas" # Mac App Store manager
brew "gnupg"
brew "httpie"
brew "hub"
brew "mackup"
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "svn"
brew "trash" # Manage the Trash bin
brew "tree" # List directories in tree structure
brew "zlib" # Needed for Memcached

# Spatie Medialibrary
brew "jpegoptim"
brew "optipng"
brew "pngquant"
brew "svgo"
brew "gifsicle"

# Development
brew "php"
brew "php@7.4"
brew "composer"
brew "imagemagick"
brew "libmemcached"
brew "meilisearch"
brew "memcached"
brew "mysql"
brew "nginx"
brew "node"
brew "redis"
brew "yarn"

# Apps
cask "figma"
cask "imageoptim"
cask "insomnia"
cask "phpmon"
cask "telegram-desktop"
cask "the-unarchiver"
cask "zoom"
cask "laravel-kit"
#cask "notion"
cask "rambox"
cask "motrix"
cask "lbry"
cask "visual-studio-code"

# Quicklook
cask "qlmarkdown"
cask "quicklook-json"

# Fonts
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-fira-mono-nerd-font"

# Mac App Store
mas "Spark", id: 1176895641
mas "Vimari", id: 1480933944
mas "JSON Peep for Safari", id: 1458969831
mas "Bitwarden", id: 1352778147
mas "Grammarly for Safari", id: 1462114288
mas "AdGuard for Safari", id: 1440147259
mas "Snap", id: 418073146
